package kr.human.anihospital.mapper;

import java.util.List;
import java.util.Map;

import org.apache.ibatis.annotations.Mapper;

@Mapper
public interface ScheduleMapper {
	//----------------------------------------------------------------------------------------------------
	// 의사 스케줄을 풀캘린더에 표시해줄 메서드
	//----------------------------------------------------------------------------------------------------
	List<Map<String, Object>> selectScheduleDoctorArrJson(int seqDoctor) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 보호자 스케줄을 풀캘린더에 표시해줄 메서드
	//----------------------------------------------------------------------------------------------------
	List<Map<String, Object>> selectAllProSchedule(int seqMember) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 의사 스케줄을 풀캘린더에 추가해줄 메서드
	//----------------------------------------------------------------------------------------------------
	void insertScheduleDoctor(Map<String, Object> scheduleDoctorMap) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 의사 스케줄을 풀캘린더에 수정해줄 메서드
	//----------------------------------------------------------------------------------------------------
	void updateScheduleDoctor(Map<String, Object> scheduleDoctorMap) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 의사 스케줄을 수정하기 위한 seq값 조회하는 메서드
	//----------------------------------------------------------------------------------------------------
	int selectSeqDoctorSchedule(Map<String, String> startEndMap) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// TO DO LIST를 추가해줄 메서드
	//----------------------------------------------------------------------------------------------------
	void insertTodolist(Map<String, Object> todolistMap) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// TO DO LIST를 화면에 뿌려줄 메서드
	//----------------------------------------------------------------------------------------------------
	List<Map<String, Object>> selectAllTodolist(int seqDoctor) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// TO DO LIST를 수정해줄 메서드
	//----------------------------------------------------------------------------------------------------
	void updateTodolist(Map<String, Object> todolistMap) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// TO DO LIST를 삭제해줄 메서드
	//----------------------------------------------------------------------------------------------------
	void deleteTodolist(int seqTodo) throws Exception;
}
