package kr.human.anihospital.service;

import java.util.List;

import kr.human.anihospital.vo.NoticeListVO;
import kr.human.anihospital.vo.NoticeOneDetailVO;
import kr.human.anihospital.vo.NoticeVO;

public interface NoticeService {
	//----------------------------------------------------------------------------------------------------
	// 모든 공지를 화면에 표시해줄 메서드
	//----------------------------------------------------------------------------------------------------
	List<NoticeListVO> selectNoticeList() throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 공지를 추가해줄 메서드
	//----------------------------------------------------------------------------------------------------
	void insertNotice(NoticeVO noticeVO) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 공지를 삭제해줄 메서드
	//----------------------------------------------------------------------------------------------------
	void deleteNotice(int seqNotice) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 공지 상세 내용을 가져올 메서드
	//----------------------------------------------------------------------------------------------------
	NoticeListVO selectNotice(int seqNotice) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 수정화면으로 이동했을 때 수정할 내용을 화면에 표시해줄 메서드
	//----------------------------------------------------------------------------------------------------
	List<NoticeOneDetailVO> selectOneDetailNotice(int seqNotice) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 공지 수정 및 수정 내용을 화면에 돌려줄 메서드
	//----------------------------------------------------------------------------------------------------
	void updateNotice(NoticeListVO noticeListVO) throws Exception;
}
