package kr.human.anihospital.service;

import java.util.Map;

import kr.human.anihospital.vo.AllNoticeListVO;
import kr.human.anihospital.vo.PagingVO;

public interface NoticeService {
	
	//----------------------------------------------------------------------------------------------------
	// 모든 공지를 화면에 표시해줄 메서드
	//----------------------------------------------------------------------------------------------------
	PagingVO<AllNoticeListVO> selectAllNoticeListVO(int currentPage, int pageSize, int blockSize) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 공지 상세 화면 & 공지 수정 화면에 표시해줄 메서드
	//----------------------------------------------------------------------------------------------------
	AllNoticeListVO selectOneDetailNoticeVO(int seqNotice) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// insert화면에 로그인 한 의사 정보 뿌려줄 메서드
	//----------------------------------------------------------------------------------------------------
	Map<String, Object> selectInsertNoticeWriterInfo(int seqDoctor, int seqAnimalHospital) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 공지를 추가해줄 메서드
	//----------------------------------------------------------------------------------------------------
	void insertOneNotice(Map<String, String> insertNoticeMap) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 공지 수정 및 수정 내용을 화면에 돌려줄 메서드
	//----------------------------------------------------------------------------------------------------
	void updateOneNotice(Map<String, String> updateNoticeMap) throws Exception;
	
	//----------------------------------------------------------------------------------------------------
	// 공지를 삭제해줄 메서드
	//----------------------------------------------------------------------------------------------------
	void deleteOneNotice(int seqNotice) throws Exception;
}
